       IDENTIFICATION DIVISION.
       PROGRAM-ID. ANIMALS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY ANIMAL.
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM GREET-DOG
           CALL 'DOG'
           STOP RUN.
       GREET-DOG.
           DISPLAY 'GREETING THE DOG'
           PERFORM PLAY-SOUND-PARA THRU PLAY-SOUND-END.
       PLAY-SOUND-PARA.
           CONTINUE.
       PLAY-SOUND-END.
           EXIT.
       END PROGRAM ANIMALS.
