>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. SOUND.
PROCEDURE DIVISION.
PLAY-SOUND-PARA.
    DISPLAY "PLAYING SOUND" *> emit the animal sound
    CALL SOUND-NAME
    GOBACK.
END PROGRAM SOUND.
